jtimon/RepRapFirmware/src/targets/STM32/BoardConfig.cpp
    // Now try each config in turn
    for(uint32_t i = 0; i < ARRAY_SIZE(SDCardConfigs); i++)
    {
        if (TryConfig(i, fs))
        {
            debugPrintf("SD card interface %d selected\n", (int)i);
            return SDCardConfigs[i].device;
        }
    }
    FatalError("Failed to mount SD card\n");
    return SSPNONE;
}

extern char _sccmram;						// defined in linker script
extern char _eccmram;					// defined in linker script
#if STM32H7
alignas(4) static __nocache uint8_t sectorBuffers[NumSdCards][512];
#endif

void BoardConfig::Init() noexcept
{

    constexpr char boardConfigPath[] = "0:/sys/board.txt";
    FIL configFile;
    FATFS *fs = new FATFS;
    FRESULT rslt;
    SSPChannel sdChannel;

    signature = crc32((char *)0x8000000, 8192);
    // We need to setup DMA and SPI devices before we can use File I/O
    // Using on STM32F4 DMA2 for both TMC UART and the SD card causes corruption problems (see STM errata) so for now we use
    // polled I/O for SPI1.
    NVIC_SetPriority(DMA2_Stream6_IRQn, NvicPrioritySpi);
    NVIC_SetPriority(DMA2_Stream3_IRQn, NvicPrioritySpi);
#if STM32H7
    NVIC_SetPriority(SDMMC1_IRQn, NvicPrioritySDIO);
    NVIC_SetPriority(SPI3_IRQn, NvicPrioritySpi);
    NVIC_SetPriority(SPI4_IRQn, NvicPrioritySpi);
    NVIC_SetPriority(DMA1_Stream1_IRQn, NvicPrioritySpi);
    NVIC_SetPriority(DMA1_Stream2_IRQn, NvicPrioritySpi);
#else
    NVIC_SetPriority(SDIO_IRQn, NvicPrioritySDIO);
#endif
    
    NVIC_SetPriority(DMA1_Stream3_IRQn, NvicPrioritySpi);
    NVIC_SetPriority(DMA1_Stream4_IRQn, NvicPrioritySpi);
    NVIC_SetPriority(DMA1_Stream0_IRQn, NvicPrioritySpi);
    NVIC_SetPriority(DMA1_Stream5_IRQn, NvicPrioritySpi);
#if STARTUP_DELAY
    delay(STARTUP_DELAY);
#endif
    ClearPinArrays();
#if STM32H7
    fs->win = sectorBuffers[0];
    memset(sectorBuffers[0], 0, sizeof(sectorBuffers[0]));
#endif
#if !HAS_MASS_STORAGE
    sd_mmc_init(SdWriteProtectPins, SdSpiCSPins);
#endif
    // Mount the internal SD card
    sdChannel = InitSDCard(signature, fs);
    if (sdChannel != SSPNONE)
    {
        //Open File
        rslt = f_open (&configFile, boardConfigPath, FA_READ);
        if (rslt != FR_OK)
        {
            f_unmount ("0:");
            FatalError("Unable to read board configuration: %s...\n",boardConfigPath );
            return;
        }
    }
    else
    {
        // failed to mount card
        FatalError("Failed to mount sd card\n");
        return;
    }
    if(rslt == FR_OK)
    {
            
        reprap.GetPlatform().MessageF(UsbMessage, "Loading config from %s...\n", boardConfigPath );

        //First find the board entry to load the correct PinTable for looking up Pin by name
        BoardConfig::GetConfigKeys(&configFile, boardEntryConfig, (size_t) ARRAY_SIZE(boardEntryConfig));
        if(!SetBoard(lpcBoardName)) // load the Correct PinTable for the defined Board (RRF3)
        {
            //Failed to find string in known boards array
            SafeStrncpy(lpcBoardName, "generic", 8); //replace the string in lpcBoardName to "generic"
        }

        //Load all other config settings now that PinTable is loaded.
        f_lseek(&configFile, 0); //go back to beginning of config file
        BoardConfig::GetConfigKeys(&configFile, boardConfigs, (size_t) ARRAY_SIZE(boardConfigs));
        f_close(&configFile);
        f_unmount ("0:");
        delete fs;
        //Calculate STEP_DRIVER_MASK (used for parallel writes)
        STEP_DRIVER_MASK = 0;
        // Currently not implemented for STM32
        #if 0
        for(size_t i=0; i<MaxTotalDrivers; i++)
        {
            //It is assumed all pins will be on Port 2
            const Pin stepPin = STEP_PINS[i];
            if( stepPin != NoPin && (stepPin >> 5) == 2) // divide by 32 to get port number
            {
                STEP_DRIVER_MASK |= (1 << (stepPin & 0x1f)); //this is a bitmask of all the stepper pins on Port2 used for Parallel Writes
            }
            else
            {
                if(stepPin != NoPin)
                {
                    // configured step pins are not on the same port - not using parallel writes
                    hasStepPinsOnDifferentPorts = true;
                }
            }
        }
        #endif
        hasStepPinsOnDifferentPorts = true;
        
        //Does board have built in current control via digipots?
        if(digipotFactor > 1)
        {
            hasDriverCurrentControl = true;
        }
#if 0
        // anti-rotation detection feature disabled for now due to potential to damage some drivers
        CheckDriverPins();
#endif       
        //Setup the SPI Pins, note that the SD SPI device may already have been configured
        for(size_t i = 0; i < ARRAY_SIZE(SPIPins); i++)
            if (sdChannel != (SSPChannel)i)
                ConfigureSPIPins((SSPChannel)i, SPIPins[i][0], SPIPins[i][1], SPIPins[i][2]);
#if HAS_MASS_STORAGE
        // Set internal SD card frequency (if supported)
        sd_mmc_reinit_slot(0, NoPin, InternalSDCardFrequency);
        if (ExternalSDCardSSPChannel != SSPNONE && SdSpiCSPins[1] != NoPin)
        {
            sd_mmc_setSSPChannel(1, ExternalSDCardSSPChannel, SdSpiCSPins[1]);
            sd_mmc_reinit_slot(1, NoPin, ExternalSDCardFrequency);
        }
        // Update RRF settings
        MassStorage::Init2();
#endif
// FIXME
#if 0
        //Internal SDCard SPI Frequency
        sd_mmc_reinit_slot(0, SdSpiCSPins[0], InternalSDCardFrequency);
        
        //Configure the External SDCard
        if(SdSpiCSPins[1] != NoPin)
        {
            setPullup(SdCardDetectPins[1], true);
            //set the SSP Channel for External SDCard
            if(ExternalSDCardSSPChannel == SSP1 || ExternalSDCardSSPChannel == SSP2 || ExternalSDCardSSPChannel == SWSPI0)
            {
                sd_mmc_setSSPChannel(1, ExternalSDCardSSPChannel); //must be called before reinit
            }
            //set the CSPin and the frequency for the External SDCard
            sd_mmc_reinit_slot(1, SdSpiCSPins[1], ExternalSDCardFrequency);
        }
#endif
    #if HAS_SBC_INTERFACE
        if(SbcCsPin != NoPin) pinMode(SbcCsPin, INPUT_PULLUP);
    #endif
    #if HAS_WIFI_NETWORKING
        if(SamCsPin != NoPin) pinMode(SamCsPin, OUTPUT_LOW);
        if(EspResetPin != NoPin) pinMode(EspResetPin, OUTPUT_LOW);
        APIN_ESP_SPI_MOSI = SPIPins[WiFiSpiChannel][2];
        APIN_ESP_SPI_MISO = SPIPins[WiFiSpiChannel][1];
        APIN_ESP_SPI_SCK = SPIPins[WiFiSpiChannel][0];
        
        if(WifiSerialRxTxPins[0] != NoPin && WifiSerialRxTxPins[1] != NoPin)
        {
            //Setup the Serial Port for ESP Wifi
            APIN_Serial1_RXD = WifiSerialRxTxPins[0];
            APIN_Serial1_TXD = WifiSerialRxTxPins[1];
            
            if(!SERIAL_WIFI_DEVICE.Configure(WifiSerialRxTxPins[0], WifiSerialRxTxPins[1]))
            {
                reprap.GetPlatform().MessageF(UsbMessage, "Failed to set WIFI Serial with pins %c.%d and %c.%d.\n", 'A'+(WifiSerialRxTxPins[0] >> 4), (WifiSerialRxTxPins[0] & 0xF), 'A'+(WifiSerialRxTxPins[1] >> 4), (WifiSerialRxTxPins[1] & 0xF) );
            }
        }
    #endif

    #if defined(SERIAL_AUX_DEVICE)
        //Configure Aux Serial
        if(AuxSerialRxTxPins[0] != NoPin && AuxSerialRxTxPins[1] != NoPin)
        {
            if(!SERIAL_AUX_DEVICE.Configure(AuxSerialRxTxPins[0], AuxSerialRxTxPins[1]))
            {
                reprap.GetPlatform().MessageF(UsbMessage, "Failed to set AUX Serial with pins %c.%d and %c.%d.\n", 'A'+(AuxSerialRxTxPins[0] >> 4), (AuxSerialRxTxPins[0] & 0xF), 'A'+(AuxSerialRxTxPins[1] >> 4), (AuxSerialRxTxPins[1] & 0xF) );
            }

