jtimon/RepRapFirmware/src/targets/STM32/BoardConfig.cpp
                                        }
                                    }

                                    if(closedSuccessfully == true)
                                    {
                                        //debugPrintf("}\n");
                                        //Array Closed - Finished Searching
                                        if(arrIdx >= 0 && arrIdx < maxArraySize) //arrIndx will be -1 if closed before reading any values
                                        {
                                            //All values read successfully, copy temp array into Final destination
                                            //dest array may be larger, dont overrite the default values
                                            for(size_t i=0; i<(arrIdx+1); i++ )
                                            {
                                                ((Pin *)(next.variable))[i] = readArray[i];
                                            }
                                            //Success!
                                            searching = false;
                                            break;

                                        }
                                        //failed to set values
                                        searching = false;
                                        break;
                                    }
                                    arrIdx++;
                                    pos++;
                                }
                                else
                                {
                                    debugPrintf("Unable to find values for Key\n");
                                    searching = false;
                                    break;
                                }
                            }//end while(searching)
                        }//end if matched key
                    }//end for

                }
                else
                {
                    //single value
                    if(pos < maxLineLength && line[pos] != 0)
                    {
                        //should be at first char of value now
                        char *valuePtr = line+pos;

                        //read until end condition - space, ;, comment, null,etc
                        while(pos < maxLineLength && line[pos] != 0 && !isSpaceOrTab(line[pos]) && line[pos] != ';' && line[pos] != '/') pos++;

                        //overrite the end condition with null....
                        line[pos] = 0; // null terminate the string (the "value")
                        //debugPrintf(" value is %s\n", valuePtr);
                        //Find the entry in boardConfigEntryArray using the key
                        //const size_t numConfigs = ARRAY_SIZE(boardConfigs);
                        for(size_t i=0; i<numConfigs; i++)
                        {
                            boardConfigEntry_t next = boardConfigEntryArray[i];
                            //Single Value config entries have nullptr for maxArrayEntries
                            if(next.maxArrayEntries == nullptr && StringEqualsIgnoreCase(key, next.key))
                            {
                                //debugPrintf("Setting value\n");
                                //match
                                BoardConfig::SetValueFromString(next.type, next.variable, valuePtr);
                            }
                        }
                    }
                }
            }
        }
        else
        {
            //Empty Line - Nothing to do here
        }

        readLen = ReadLine(configFile, line, maxLineLength); //attempt to read the next line
        //debugPrintf("ReadLine returns %d\n", readLen);
    }
    return false;
}

void assert_failed(uint8_t *file, uint32_t line)
{
    debugPrintf("Assert failed file %s line %d\n", file, (int)line);
}


#if HAS_SBC_INTERFACE

// Routines to support firmware update from the SBC.
static constexpr char firmwarePath[] = "0:/firmware.bin";
static FIL *firmwareFile = nullptr;
static FATFS *fs = nullptr;

bool BoardConfig::BeginFirmwareUpdate()
{
    bool res = true;
    FRESULT rslt;
    fs = new FATFS;
    firmwareFile = new FIL;
    rslt = f_mount (fs, "0:", 1);
    if (rslt == FR_OK)
    {
        //Open File, and zero length
        rslt = f_open (firmwareFile, firmwarePath, FA_WRITE|FA_CREATE_ALWAYS);
        if (rslt != FR_OK)
        {
            reprap.GetPlatform().MessageF(UsbMessage, "Unable to create firmware file: %s...\n", firmwarePath);
            f_unmount ("0:");
            res = false;
        }
    }
    else
    {
        // failed to mount card
        reprap.GetPlatform().MessageF(UsbMessage, "Failed to mount sd card\n");
        res = false;
    }
    if (!res)
    {
        delete firmwareFile;
        delete fs;
        firmwareFile = nullptr;
        fs = nullptr;
    }
    return res;
}

bool BoardConfig::WriteFirmwareData(const char *data, uint16_t length)
{
    FRESULT rslt;
    UINT written;
    if (firmwareFile == nullptr) return false;
    rslt = f_write(firmwareFile, data, length, &written);
    if (rslt != FR_OK || length != written)
        debugPrintf("Write to firmware file failed err %d length requested %d actual %d\n", rslt, length, written);
    return rslt == FR_OK && length == written;    
}

void BoardConfig::EndFirmwareUpdate()
{
    if (firmwareFile != nullptr)
    {
        FRESULT rslt = f_close(firmwareFile);
        if (rslt != FR_OK) debugPrintf("file close failed err %d\n", rslt);
        rslt = f_unmount("0:");
        if (rslt != FR_OK) debugPrintf("unmount failed err %d\n", rslt);
        delete fs;
        delete firmwareFile;
        fs = nullptr;
        firmwareFile = nullptr;
    }
    reprap.EmergencyStop();			// turn off heaters etc.
    debugPrintf("Restarting....\n");
    delay(1000);
    SoftwareReset(SoftwareResetReason::user); // Reboot
}
#endif




